// The following queries detect changes in the 'Safe Links' policy when some of the following settings are turned into a false state:
// EnableSafeLinksForTeams
// EnableSafeLinksForEmail
// EnableSafeLinksForOffice
// EnableForInternalSenders

// Query changes for SafeLinks Policy in OfficeActivity table
OfficeActivity 
| where TimeGenerated > ago(1d) 
| where RecordType contains "ExchangeAdmin"
| where OfficeWorkload == "Exchange"
| where Operation contains "Set-SafeLinksPolicy"
| extend ['PolicyName'] = tostring(parse_json(Parameters)[6].Value)
| extend ['ScanUrls'] = tostring(parse_json(Parameters)[1].Name)
| extend ['ScanUrlsValue'] = tostring(parse_json(Parameters)[1].Value)
| extend ['DoNotRewriteUrls'] = tostring(parse_json(Parameters)[2].Name)
| extend ['DoNotRewriteUrlsValue'] = tostring(parse_json(Parameters)[2].Value)
| extend ['EnableSafeLinksForTeams'] = tostring(parse_json(Parameters)[4].Name)
| extend ['EnableSafeLinksForTeamsValue'] = tostring(parse_json(Parameters)[4].Value)
| extend ['EnableSafeLinksForEmail'] = tostring(parse_json(Parameters)[5].Name)
| extend ['EnableSafeLinksForEmailValue'] = tostring(parse_json(Parameters)[5].Value)
| extend ['DisableUrlRewrite'] = tostring(parse_json(Parameters)[7].Name)
| extend ['DisableUrlRewriteValue'] = tostring(parse_json(Parameters)[7].Value)
| extend ['EnableForInternalSenders'] = tostring(parse_json(Parameters)[8].Name)
| extend ['EnableForInternalSendersValue'] = tostring(parse_json(Parameters)[8].Value)
| extend ['AllowClickThrough'] = tostring(parse_json(Parameters)[9].Name)
| extend ['AllowClickThroughValue'] = tostring(parse_json(Parameters)[9].Value)
| extend ['Identity'] = tostring(parse_json(Parameters)[10].Name)
| extend ['IdentityValue'] = tostring(parse_json(Parameters)[10].Value)
| extend ['EnableSafeLinksForOffice'] = tostring(parse_json(Parameters)[12].Name)
| extend ['EnableSafeLinksForOfficeValue'] = tostring(parse_json(Parameters)[12].Value)
| extend ['TrackClicks'] = tostring(parse_json(Parameters)[14].Name)
| extend ['TrackClicksValue'] = tostring(parse_json(Parameters)[14].Value)
| where EnableSafeLinksForTeamsValue == 'False' or EnableSafeLinksForEmailValue == 'False' or EnableSafeLinksForOfficeValue == 'False' or EnableForInternalSendersValue == 'False'



// Query changes for SafeLinks Policy in OfficeActivity table
CloudAppEvents
| where TimeGenerated > ago(30d) 
| where Application contains "Microsoft Exchange Online"
| where ApplicationId == '20893'
| where ActionType contains "Set-SafeLinksPolicy"
//| where OfficeObjectId == "No direct click through"
| extend ['PolicyName'] = tostring(ActivityObjects[8].Name)
| extend ['PolicyValue'] = tostring(ActivityObjects[8].Value)
| extend ['ScanUrls'] = tostring(parse_json(tostring(RawEventData.Parameters))[1].Name)
| extend ['ScanUrlsValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[1].Value)
| extend ['DoNotRewriteUrls'] = tostring(parse_json(tostring(RawEventData.Parameters))[2].Name)
| extend ['DoNotRewriteUrlsValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[2].Value)
| extend ['EnableSafeLinksForTeams'] = tostring(parse_json(tostring(RawEventData.Parameters))[4].Name)
| extend ['EnableSafeLinksForTeamsValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[4].Value)
| extend ['EnableSafeLinksForEmail'] = tostring(parse_json(tostring(RawEventData.Parameters))[5].Name)
| extend ['EnableSafeLinksForEmailValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[5].Value)
| extend ['DisableUrlRewrite'] = tostring(parse_json(tostring(RawEventData.Parameters))[7].Name)
| extend ['DisableUrlRewriteValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[7].Value)
| extend ['EnableForInternalSenders'] = tostring(parse_json(tostring(RawEventData.Parameters))[8].Name)
| extend ['EnableForInternalSendersValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[8].Value)
| extend ['AllowClickThrough'] = tostring(parse_json(tostring(RawEventData.Parameters))[9].Name)
| extend ['AllowClickThroughValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[9].Value)
| extend ['Identity'] = tostring(parse_json(tostring(RawEventData.Parameters))[10].Name)
| extend ['IdentityValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[10].Value)
| extend ['EnableSafeLinksForOffice'] = tostring(parse_json(tostring(RawEventData.Parameters))[12].Name)
| extend ['EnableSafeLinksForOfficeValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[12].Value)
| extend ['TrackClicks'] = tostring(parse_json(tostring(RawEventData.Parameters))[14].Name)
| extend ['TrackClicksValue'] = tostring(parse_json(tostring(RawEventData.Parameters))[14].Value)
| where EnableSafeLinksForTeamsValue == 'False' or EnableSafeLinksForEmailValue == 'False' or EnableSafeLinksForOfficeValue == 'False' or EnableForInternalSendersValue == 'False'